In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [4]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [12]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [13]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [16]:
df.loc[2, ['last', 'email']] = ['smithiy', 'smithy@email.com']

In [17]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John  smithiy         smithy@email.com

In [18]:
df.loc[2, 'last'] = 'Smith'

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith         smithy@email.com

In [20]:
df.at[2, 'last']='Smithy'

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John   Smithy         smithy@email.com

In [24]:
filt = (df['email'] == 'smithy@email.com')

In [25]:
df[filt]

  first    last             email
2  John  Smithy  smithy@email.com

In [29]:
df[filt]['first'] = 'Kylie'

/home/shahriar/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [32]:
df.loc[filt, 'last'] = 'Smith'

In [33]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith         smithy@email.com

In [35]:
df['email'] = df['email'].str.lower()

In [37]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith         smithy@email.com

In [38]:
df['email'].apply(len)

0    23
1    17
2    16
Name: email, dtype: int64

In [39]:
def email_uppercase(email):
    return email.upper()

In [40]:
df['email'].apply(email_uppercase)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2           SMITHY@EMAIL.COM
Name: email, dtype: object

In [41]:
df['email'] = df['email'].apply(email_uppercase)

In [42]:
df['email']

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2           SMITHY@EMAIL.COM
Name: email, dtype: object

In [43]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [44]:
df['email']

0    coreymschafer@gmail.com
1          janedoe@email.com
2           smithy@email.com
Name: email, dtype: object

In [45]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [46]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [47]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [48]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     16

In [51]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith         smithy@email.com

In [52]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [53]:
df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [54]:
df['first']= df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [55]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith         smithy@email.com